In [0]:
import pandas as pd

In [23]:
dataset = "https://raw.githubusercontent.com/TrainingByPackt/Data-Science-with-Python/master/Chapter01/Data/USA_Housing.csv"
df = pd.read_csv(dataset, header = 0)
df.head()

   Avg. Area Income  ...                                            Address
0      79545.458574  ...  208 Michael Ferry Apt. 674\nLaurabury, NE 3701...
1      79248.642455  ...  188 Johnson Views Suite 079\nLake Kathleen, CA...
2      61287.067179  ...  9127 Elizabeth Stravenue\nDanieltown, WI 06482...
3      63345.240046  ...                          USS Barnett\nFPO AP 44820
4      59982.197226  ...                         USNS Raymond\nFPO AE 09386

[5 rows x 7 columns]



```
df.columns
```
will print all the names of the columns

In [24]:
df.columns

Index(['Avg. Area Income', 'Avg. Area House Age', 'Avg. Area Number of Rooms',
       'Avg. Area Number of Bedrooms', 'Area Population', 'Price', 'Address'],
      dtype='object')

```
df.index
```
will print the number of rows

In [25]:
df.index

RangeIndex(start=0, stop=5000, step=1)

We will use the **Address** column to uniqely identify a row by making it `index`.

`Dataframe.set_index('column name', inplace = True')'`
will set the `column name` as new index and if `inplace = True` then the actual dataframe will change without making a copy.

In [26]:
df.set_index('Address', inplace = True)
df.head()

                                                    Avg. Area Income  ...         Price
Address                                                               ...
208 Michael Ferry Apt. 674\nLaurabury, NE 37010...      79545.458574  ...  1.059034e+06
188 Johnson Views Suite 079\nLake Kathleen, CA ...      79248.642455  ...  1.505891e+06
9127 Elizabeth Stravenue\nDanieltown, WI 06482-...      61287.067179  ...  1.058988e+06
USS Barnett\nFPO AP 44820                               63345.240046  ...  1.260617e+06
USNS Raymond\nFPO AE 09386                              59982.197226  ...  6.309435e+05

[5 rows x 6 columns]

We will reset the index again by using `df.reset_index(inplace = True)`

In [27]:
df.reset_index(inplace = True)
df.head()

                                             Address  ...         Price
0  208 Michael Ferry Apt. 674\nLaurabury, NE 3701...  ...  1.059034e+06
1  188 Johnson Views Suite 079\nLake Kathleen, CA...  ...  1.505891e+06
2  9127 Elizabeth Stravenue\nDanieltown, WI 06482...  ...  1.058988e+06
3                          USS Barnett\nFPO AP 44820  ...  1.260617e+06
4                         USNS Raymond\nFPO AE 09386  ...  6.309435e+05

[5 rows x 7 columns]

We can retrieve the first four rows and the first three columns using a row number and column number. This can be done using the iloc indexer in pandas, which retrieves data using index positions. Add the following code to do this:
`df.iloc[0:4 , 0:3]`

In [28]:
df.iloc[0:4 , 0:3]

                                             Address  ...  Avg. Area House Age
0  208 Michael Ferry Apt. 674\nLaurabury, NE 3701...  ...             5.682861
1  188 Johnson Views Suite 079\nLake Kathleen, CA...  ...             6.002900
2  9127 Elizabeth Stravenue\nDanieltown, WI 06482...  ...             5.865890
3                          USS Barnett\nFPO AP 44820  ...             7.188236

[4 rows x 3 columns]

To retrieve the data using labels, we use the loc indexer by 
```df.loc[0:4 , ["Avg. Area Income", "Avg. Area House Age"]]```

In [29]:
df.loc[0:4 , ["Avg. Area Income", "Avg. Area House Age", "Price"]]

   Avg. Area Income  Avg. Area House Age         Price
0      79545.458574             5.682861  1.059034e+06
1      79248.642455             6.002900  1.505891e+06
2      61287.067179             5.865890  1.058988e+06
3      63345.240046             7.188236  1.260617e+06
4      59982.197226             5.040555  6.309435e+05

In our dataset, `Price` is the target vector which we want to predict. So we want to drop them from the independent matrix. We can do that by using
`df.drop('column name', axis = 0/1)`

Here, the axis parameter denotes whether you want to drop the label from rows `(axis = 0)` or columns `(axis = 1)`.

In [31]:
X = df.drop('Price', axis = 1)
X.head()

                                             Address  ...  Area Population
0  208 Michael Ferry Apt. 674\nLaurabury, NE 3701...  ...     23086.800503
1  188 Johnson Views Suite 079\nLake Kathleen, CA...  ...     40173.072174
2  9127 Elizabeth Stravenue\nDanieltown, WI 06482...  ...     36882.159400
3                          USS Barnett\nFPO AP 44820  ...     34310.242831
4                         USNS Raymond\nFPO AE 09386  ...     26354.109472

[5 rows x 6 columns]

Let's check the shape of our matrix by using
`X.shape`

In [33]:
X.shape

(5000, 6)

Store the target variable in another variable called `y`

In [37]:
y = df['Price']
y.head()

0    1.059034e+06
1    1.505891e+06
2    1.058988e+06
3    1.260617e+06
4    6.309435e+05
Name: Price, dtype: float64

In [38]:
y.shape

(5000,)